package com.welldo.zero.a20_functional;

/**
 * 0. 什么是函数。
 * 函数是一种最基本的任务，一个大型程序就是一个顶层函数调用若干底层函数，这些被调用的函数又可以调用其他函数，即大任务被一层层拆解并执行。
 * 所以函数就是面向过程的程序设计的基本单元。
 *
 * 1.
 * 而函数式编程（请注意多了一个“式”字）——Functional Programming，虽然也可以归结到面向过程的程序设计，但其思想更接近数学计算。
 *
 * 我们首先要搞明白计算机（Computer）和计算（Compute）的概念。
 * 在计算机的层次上，CPU执行的是加减乘除的指令代码，以及各种条件判断和跳转指令，所以，汇编语言是最贴近计算机的语言。
 * 而计算则指数学意义上的计算，越是抽象的计算，离计算机硬件越远。
 *
 * 对应到编程语言，
 * 越低级的语言，越贴近计算机，抽象程度低，执行效率高，比如C语言；
 * 越高级的语言，越贴近计算，抽象程度高，执行效率低，比如Lisp语言。
 *
 * 函数式编程就是一种抽象程度很高的编程范式
 * Java平台从Java 8开始，支持函数式编程。
 *
 *
 * @author welldo
 * @date 2020/9/16
 */
public class What1 {
}
